app/views/messages/index.html.erb

  <h6 class="border-bottom border-gray pb-2 mb-0">Inbox</h6>
  <% User.current.inbox.messages.each do |message| %>
---
SELECT  "inboxes".* FROM "inboxes" WHERE "inboxes"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]

        <p class="media-body pb-3 mb-0 small lh-125 border-bottom border-gray">
          <strong class="d-block text-gray-dark"><%= message.outbox.user.first_name %> <%= message.outbox.user.last_name %></strong>
---
SELECT  "outboxes".* FROM "outboxes" WHERE "outboxes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]