app/controllers/messages_controller.rb

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @message = Message.find(params[:id])

INSERT INTO "messages" ("body", "outbox_id", "inbox_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "jhdjgd"], ["outbox_id", 1], ["inbox_id", 2], ["created_at", "2020-05-28 06:52:35.620572"], ["updated_at", "2020-05-28 06:52:35.620572"]]
---
  def create
    @message = new_message

    if @message.save